<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Uses parent pkg recipe to download latest Firefox ESR and import it into the JSS.</string>
        <key>Identifier</key>
        <string>com.github.ahschools.jss.FirefoxESR</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Mozilla Firefox ESR</string>
            <key>RELEASE</key>
			<string>esr-latest</string>
            <key>DOWNLOAD_URL</key>
        	<string>https://download.mozilla.org/?product=firefox-esr-latest&amp;os=osx&amp;lang=en-US</string>
            <key>JSS_INVENTORY_NAME</key>
            <string>Firefox.app</string>
            <key>CATEGORY</key>
            <string>Browsers</string>
            <key>DESCRIPTION</key>
            <string>Web Browser</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.autopkg.pkg.Firefox_EN</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>jss_inventory_name</key>
                    <string>%JSS_INVENTORY_NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
