<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Uses parent pkg recipe to download latest Firefox ESR and import it into the JSS.</string>
        <key>Identifier</key>
        <string>com.github.ahschools.pkg.FirefoxESR</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Mozilla Firefox ESR</string>
            <key>RELEASE</key>
			<string>esr-latest</string>
            <key>DOWNLOAD_URL</key>
        	<string>https://download.mozilla.org/?product=firefox-esr-next-latest&amp;os=osx&amp;lang=en-US</string>
            <key>JSS_INVENTORY_NAME</key>
            <string>Firefox.app</string>
            <key>CATEGORY</key>
            <string>Browsers</string>
            <key>DESCRIPTION</key>
            <string>Web Browser</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.autopkg.pkg.Firefox_EN</string>
        <key>Process</key>
          <array>
            <dict>
                <key>Processor</key>
                <string>AppDmgVersioner</string>
                <key>Arguments</key>
                <dict>
                    <key>flat_pkg_path</key>
                    <string>%pathname%</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgPayloadUnpacker</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_payload_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpack/Payload</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/payload</string>
                </dict>
            </dict>            
            <dict>
                <key>Processor</key>
                <string>Versioner</string>
                <key>Arguments</key>
                <dict>
                    <key>input_plist_path</key>
                    <string>%RECIPE_CACHE_DIR%/payload/%SOFTWARETITLE%.app/Contents/Info.plist</string>
                    <key>plist_version_key</key>
                    <string>CFBundleShortVersionString</string>
                </dict>
            </dict>
             <dict>
                <key>Processor</key>
                <string>PkgCopier</string>
                <key>Arguments</key>
                <dict>
                   <key>source_pkg</key>
                   <string>%pathname%</string>
                   <key>pkg_path</key>
                   <string>%RECIPE_CACHE_DIR%/%VENDOR%-%SOFTWARETITLE%-%version%.pkg</string>
                </dict>
             </dict>
             <dict>
                <key>Processor</key>
                <string>PathDeleter</string>
                <key>Arguments</key>
                <dict>
                   <key>path_list</key>
                   <array>
                      <string>%RECIPE_CACHE_DIR%/payload</string>
                      <string>%RECIPE_CACHE_DIR%/unpack</string>
                   </array>
                </dict>
             </dict>
          </array>
    </dict>
</plist>
